## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-05T16:10:26.000+0000" -> (known after apply)
      ~ layers                         = [
-           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:41",
        ]
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/2c72a14b68289efdffb2355f93456f3068b5788e838a494b9e323e1931a1c84c.zip" -> "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.zip"
      ~ s3_object_version              = "eennUj4zO6yTgabRJbGCTOz5wZUoB9pf" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:6c79b373e21a1de02f8ea191b3f39a3eef3d8043,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:815517eb90fb2edd71c1a1b474fe16c0e9f95bcc,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "6c79b373e21a1de02f8ea191b3f39a3eef3d8043" -> "815517eb90fb2edd71c1a1b474fe16c0e9f95bcc"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "7" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e16c0cf79d2f418066192841676c0f36-2" -> (known after apply)
      ~ id                     = "builds/2c72a14b68289efdffb2355f93456f3068b5788e838a494b9e323e1931a1c84c.zip" -> (known after apply)
      ~ key                    = "builds/2c72a14b68289efdffb2355f93456f3068b5788e838a494b9e323e1931a1c84c.zip" -> "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/2c72a14b68289efdffb2355f93456f3068b5788e838a494b9e323e1931a1c84c.zip" -> "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.zip"
-       tags                   = {} -> null
      ~ version_id             = "eennUj4zO6yTgabRJbGCTOz5wZUoB9pf" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "860084327348974946" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2c72a14b68289efdffb2355f93456f3068b5788e838a494b9e323e1931a1c84c.zip" -> "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.zip"
          ~ "timestamp" = "1680710913729629000" -> "1680804795621449000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1710816930940905303" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/2c72a14b68289efdffb2355f93456f3068b5788e838a494b9e323e1931a1c84c.zip" -> "builds/97b92180ff8b8c50d4ae09ff09c0a5d14c4ab70c414db6cd8d11a07b72af0d63.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-05T16:10:25.000+0000" -> (known after apply)
      ~ layers                         = [
-           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:41",
        ]
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/1a9f9cc9dfbcd45049eaff84d5e10e62e84f536b8bf075145dd28cfdfc0a74ec.zip" -> "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.zip"
      ~ s3_object_version              = "SCJUvnavg3d4NXcpdr0q8ogRziIf0BLJ" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:6c79b373e21a1de02f8ea191b3f39a3eef3d8043,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:815517eb90fb2edd71c1a1b474fe16c0e9f95bcc,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "6c79b373e21a1de02f8ea191b3f39a3eef3d8043" -> "815517eb90fb2edd71c1a1b474fe16c0e9f95bcc"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ae2a20f8f0287457f0788173a43a4191-2" -> (known after apply)
      ~ id                     = "builds/1a9f9cc9dfbcd45049eaff84d5e10e62e84f536b8bf075145dd28cfdfc0a74ec.zip" -> (known after apply)
      ~ key                    = "builds/1a9f9cc9dfbcd45049eaff84d5e10e62e84f536b8bf075145dd28cfdfc0a74ec.zip" -> "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/1a9f9cc9dfbcd45049eaff84d5e10e62e84f536b8bf075145dd28cfdfc0a74ec.zip" -> "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.zip"
-       tags                   = {} -> null
      ~ version_id             = "SCJUvnavg3d4NXcpdr0q8ogRziIf0BLJ" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1576526221860595683" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1a9f9cc9dfbcd45049eaff84d5e10e62e84f536b8bf075145dd28cfdfc0a74ec.zip" -> "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.zip"
          ~ "timestamp" = "1680710913485059000" -> "1680804795644435800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "160764151572183357" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/1a9f9cc9dfbcd45049eaff84d5e10e62e84f536b8bf075145dd28cfdfc0a74ec.zip" -> "builds/908ca225cbd5ebd7df4206d39b5501cc31bb129bb6490f5c18aee0cdc0cf94ba.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 6 to change, 8 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4631804787)*